app/controllers/todo_controller.rb

  def edit
    @task = Task.find(params[:id])
---
SELECT * FROM `tasks` WHERE (`tasks`.`id` = 1)

  def delete
    id = params[:id]
    Task.delete(id)
---
DELETE FROM `tasks` WHERE (`id` IN ('2'))